In [1]:
import pandas as pd
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
import json

In [2]:
basics = pd.read_csv("Data/title_basics.csv.gz")
ratings = pd.read_csv("Data/title_ratings.csv.gz")
akas  = pd.read_csv("Data/title_akas.csv.gz")

# Creating data base

In [3]:
with open("c:/Users/oscar/.secret/sql_key.json", "r") as f:
    login = json.load(f)
login.keys()

dict_keys(['sql_key'])

In [4]:
connection = f"mysql+pymysql://root:{login['sql_key']}@localhost/movie_db"

In [5]:
engine = create_engine(connection)
engine

Engine(mysql+pymysql://root:***@localhost/movie_db)

In [6]:
create_database(connection)

In [7]:
database_exists(connection)

True

# Transformations "basics"

In [8]:
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genre
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","comedy,fantasy,romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","comedy,horror,sci-fi"
4,tt0093119,movie,Grizzly II: Revenge,Grizzly II: The Predator,0,2020,NaN,74,"Horror,Music,Thriller","horror,music,thriller"

## Converting "genres" entries into list

In [9]:
# entries are strings
basics["genres"][0]

'Comedy,Fantasy,Romance'

In [10]:
basics["genres_split"] = basics["genres"].apply(lambda x: x.split(","))
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genre,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","comedy,fantasy,romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","comedy,horror,sci-fi","[Comedy, Horror, Sci-Fi]"
4,tt0093119,movie,Grizzly II: Revenge,Grizzly II: The Predator,0,2020,NaN,74,"Horror,Music,Thriller","horror,music,thriller","[Horror, Music, Thriller]"

## Expanding our list of genres to individual strings

In [11]:
exploded_genres = basics.explode("genres_split")
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genre,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","comedy,fantasy,romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","comedy,fantasy,romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","comedy,fantasy,romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,drama,Drama
...,...,...,...,...,...,...,...,...,...,...,...
80808,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller","action,adventure,thriller",Action
80808,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller","action,adventure,thriller",Adventure
80808,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller","action,adventure,thriller",Thriller
80809,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History","drama,history",Drama
80809,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History","drama,history",History

## Getting our unique genres

In [12]:
unique_genres = sorted(exploded_genres["genres_split"].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

## Creating new df title_genres table

In [13]:
title_genres = exploded_genres[["tconst", "genres_split"]].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [14]:
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

## Creating mapper dictionary for our genres

In [15]:
title_genres["genre_id"] = title_genres["genres_split"].map(genre_map)

In [16]:
title_genres = title_genres.drop(columns="genres_split")

In [17]:
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

## Converting genre map into data frame

In [18]:
genres = pd.DataFrame({"Genre_Name": genre_map.keys(),
                            "Genre_ID": genre_map.values()})

In [19]:
genres

    Genre_Name  Genre_ID
0       Action         0
1        Adult         1
2    Adventure         2
3    Animation         3
4    Biography         4
5       Comedy         5
6        Crime         6
7        Drama         7
8       Family         8
9      Fantasy         9
10   Game-Show        10
11     History        11
12      Horror        12
13       Music        13
14     Musical        14
15     Mystery        15
16        News        16
17  Reality-TV        17
18     Romance        18
19      Sci-Fi        19
20       Short        20
21       Sport        21
22   Talk-Show        22
23    Thriller        23
24         War        24
25     Western        25

## Dropping unwanted columns

In [20]:
basics = basics.drop(columns=["genre", "genres", "endYear", "originalTitle",
                             "isAdult", "titleType", "genres_split"])

In [21]:
basics

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0088751,The Naked Monster,2005,100
4,tt0093119,Grizzly II: Revenge,2020,74
...,...,...,...,...
80805,tt9914942,Life Without Sara Amat,2019,74
80806,tt9915872,The Last White Witch,2019,97
80807,tt9916170,The Rehearsal,2019,51
80808,tt9916190,Safeguard,2020,90
80809,tt9916362,Coven,2020,92

# Saving MySQL tables

In [22]:
from sqlalchemy.types import *

## User defined function to create schema

In [23]:
def to_sql_table(df, columns, dtypes):
    key_inc = 0
    schema = {}
    for x, col in enumerate(columns):
        if (key_inc == 0) and (dtypes[x] == "object"):
            key_len = df[col].fillna("").map(len).max()
            schema[col] = String(key_len+1)
            
            key_inc += 1
            
        elif (dtypes[x] == "object"):
            col_len = df[col].fillna("").map(len).max()
            schema[col] = Text(col_len)
            
        elif str(dtypes[x]).find("f") != -1:
            schema[col] = Float()
        
        elif str(dtypes[x]).find("i") != -1:
            schema[col] = Integer()
        
        elif dtypes[x] == "bool" != -1:
            schema[col] = Boolean()

    return schema

## Saving basics table

In [53]:
basics.dtypes

tconst            object
primaryTitle      object
startYear          int64
runtimeMinutes     int64
dtype: object

In [25]:
basics_cols = list(basics.columns)
basics_dtypes = list(basics.dtypes)

In [26]:
basics_schema = to_sql_table(df=basics, columns=basics_cols, 
                             dtypes=basics_dtypes)

In [27]:
basics_schema

{'tconst': String(length=11),
 'primaryTitle': Text(length=242),
 'startYear': Integer(),
 'runtimeMinutes': Integer()}

In [28]:
basics.to_sql("title_basics", engine, dtype=basics_schema, if_exists="replace", index=False)

In [29]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

### SQL query title_basics

In [54]:
basic_query = """SELECT * 
                 FROM title_basics
                 LIMIT 5;
              """
pd.read_sql(basic_query, engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0088751,The Naked Monster,2005,100
4,tt0093119,Grizzly II: Revenge,2020,74

## Saving ratings table

In [30]:
ratings_cols = list(ratings.columns)
ratings_dtypes = list(ratings.dtypes)

In [31]:
ratings_cols

['tconst', 'averageRating', 'numVotes']

In [32]:
ratings_schema = to_sql_table(df=ratings, columns=ratings_cols, 
                              dtypes=ratings_dtypes)

In [33]:
ratings_schema

{'tconst': String(length=11), 'averageRating': Float(), 'numVotes': Integer()}

In [34]:
ratings.to_sql("title_ratings", engine, dtype=ratings_schema, if_exists="replace", index=False)

In [35]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

### SQL query title_ratings table

In [55]:
ratings_query = """SELECT * 
                   FROM title_ratings
                   LIMIT 5;
                """
pd.read_sql(ratings_query, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1878
1  tt0000002            5.9       248
2  tt0000003            6.5      1650
3  tt0000004            5.8       160
4  tt0000005            6.2      2475

## Savings title_genres table

In [36]:
title_genres.dtypes

tconst      object
genre_id     int64
dtype: object

In [37]:
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

In [38]:
title_genres.set_index("genre_id").to_sql("title_genres", engine, index=True)

### SQL query title_genres

In [56]:
title_genres_query = """SELECT * 
                        FROM title_genres
                        LIMIT 5;
                     """
pd.read_sql(title_genres_query, engine)

   genre_id     tconst
0         5  tt0035423
1         9  tt0035423
2        18  tt0035423
3         7  tt0062336
4         7  tt0069049

## Saving genres

In [39]:
genres.dtypes

Genre_Name    object
Genre_ID       int64
dtype: object

In [40]:
genres.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [41]:
genres.set_index("Genre_ID").to_sql("genres", engine, index=True)

## Saving tmdb_data

In [42]:
tmdb_df = pd.read_csv("Data/tmdb_results_combined_2000-2001.csv.gz")
tmdb_df.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",http://www.wkw-inthemoodforlove.com/,843.0,cn,花樣年華,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.1,1865.0,PG
1,tt0120467,0.0,NaN,NaN,120000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 27, 'name...",NaN,19085.0,en,Vulgar,...,14904.0,87.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Everyone loves a clown... some more than others.,Vulgar,0.0,5.5,40.0,R
2,tt0120630,0.0,/t7aJ7hqsMLEoqBJk7yAXxcAVvcz.jpg,"{'id': 718551, 'name': 'Chicken Run Collection...",45000000.0,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...",NaN,7443.0,en,Chicken Run,...,224834564.0,84.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,This ain't no chick flick. It's poultry in mot...,Chicken Run,0.0,6.7,3996.0,G
3,tt0120753,0.0,/cXXxi0j9sXFt7LbeajuFoKFqWMu.jpg,NaN,8000000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 53, 'name...",NaN,318.0,en,The Million Dollar Hotel,...,105983.0,122.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Everyone has something to hide.,The Million Dollar Hotel,0.0,5.9,247.0,R
4,tt0120755,0.0,/8XaohdSqoBEWHhW40q2VTdMBrV0.jpg,"{'id': 87359, 'name': 'Mission: Impossible Col...",125000000.0,"[{'id': 12, 'name': 'Adventure'}, {'id': 28, '...",NaN,955.0,en,Mission: Impossible II,...,546388105.0,123.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Expect the impossible again.,Mission: Impossible II,0.0,6.1,5274.0,PG-13

### Getting our columns to drop

In [43]:
cols_to_drop = []
for col in tmdb_df.columns:
    if (col != "imdb_id") and (col != "revenue") and (col != "budget") and (col != "certification"):
        cols_to_drop.append(col)

In [44]:
cols_to_drop

['adult',
 'backdrop_path',
 'belongs_to_collection',
 'genres',
 'homepage',
 'id',
 'original_language',
 'original_title',
 'overview',
 'popularity',
 'poster_path',
 'production_companies',
 'production_countries',
 'release_date',
 'runtime',
 'spoken_languages',
 'status',
 'tagline',
 'title',
 'video',
 'vote_average',
 'vote_count']

In [45]:
tmdb_df = tmdb_df.drop(columns=cols_to_drop)
tmdb_df.head()

     imdb_id       budget      revenue certification
0  tt0118694     150000.0   12854953.0            PG
1  tt0120467     120000.0      14904.0             R
2  tt0120630   45000000.0  224834564.0             G
3  tt0120753    8000000.0     105983.0             R
4  tt0120755  125000000.0  546388105.0         PG-13

In [46]:
tmdb_cols = list(tmdb_df.columns)
tmdb_dtypes = list(tmdb_df.dtypes)

In [47]:
tmdb_cols

['imdb_id', 'budget', 'revenue', 'certification']

In [48]:
tmdb_schema = to_sql_table(df=tmdb_df, columns=tmdb_cols, dtypes=tmdb_dtypes)
tmdb_schema

{'imdb_id': String(length=10),
 'budget': Float(),
 'revenue': Float(),
 'certification': Text(length=5)}

In [49]:
tmdb_df.to_sql("tmdb_data", engine, dtype=tmdb_schema, if_exists="replace", index=False)

In [50]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

### SQL query  tmdb_data

In [58]:
tmdb_query = """SELECT * 
                FROM tmdb_data
                LIMIT 5;
             """
pd.read_sql(tmdb_query, engine)

     imdb_id      budget      revenue certification
0  tt0035423  48000000.0   76019000.0         PG-13
1  tt0118589  22000000.0    5271670.0         PG-13
2  tt0118694    150000.0   12855000.0            PG
3  tt0120467    120000.0      14904.0             R
4  tt0120630  45000000.0  224835000.0             G

# SHOW TABLES

In [64]:
tables_query = """SHOW TABLES;"""
pd.read_sql(tables_query, engine)

  Tables_in_movie_db
0             genres
1       title_basics
2       title_genres
3      title_ratings
4          tmdb_data